Revit 2027 API
SlabShapeVertex Properties
The SlabShapeVertex type exposes the following members.
Properties
Name | Description
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
Position |  The vertex position
VertexType |  The vertex type
Top
See Also
Reference
SlabShapeVertex Class
Autodesk.Revit.DB Namespace